quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Как называется основной интерпретатор Python?',
        'options': ['Python', 'Cython', 'PyPy', 'CPython'],
        'correct_option': 0
    },
    {
        'question': 'Что такое PEP в контексте Python?',
        'options': ['Пакет расширений Python', 'Предложение по улучшению Python', 'Программа для редактирования Python-кода', 'Плагин для Python'],
        'correct_option': 1
    },
    {
        'question': 'Какой оператор используется для сравнения двух значений в Python?',
        'options': ['==', '<>', '<=', '>='],
        'correct_option': 0
    },
    {
        'question': 'Какая функция используется для вывода текста в консоль в Python?',
        'options': ['print()', 'show()', 'output()', 'console()'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения дробных чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 2
    },
    {
        'question': 'Что такое цикл for в Python?',
        'options': ['Оператор, который позволяет выполнять код многократно', 'Функция, которая возвращает значение', 'Условный оператор, который проверяет условие', 'Метод, который изменяет значение переменной'],
        'correct_option': 0
    },
    {
        'question': 'Что такое список в Python?',
        'options': ['Тип данных, который хранит упорядоченный набор элементов', 'Оператор, который выполняет код многократно', 'Функция, которая выводит текст в консоль', 'Объект, который представляет собой строку'],
        'correct_option': 0
    },
    {
        'question': 'Что такое словарь в Python?',
        'options': ['Тип данных, который хранит неупорядоченный набор пар ключ-значение', 'Оператор, который сравнивает два значения', 'Функция, которая принимает аргументы', 'Объект, который является экземпляром класса'],
        'correct_option': 0
    }
]